<?php
//配置文件
return [
    /**
     * Index静态资源路径配置
     * 需要在index.php中定义 STATIC_PATH
     */
    'view_replace_str' => [
        '__CSS__'    => STATIC_PATH . 'index/css',
        '__JS__'     => STATIC_PATH . 'index/js',
        '__IMG__'    => STATIC_PATH . 'index/image',
        '__LIB__'    => STATIC_PATH . 'index/lib',
    ],

    // SEO三大标签设置
    
    'subtitle' => '豆笑笑个人博客',

    'seo' => [
        'index' => [
            'title' => '豆笑笑个人博客 分享技术教程的个人博客小窝',
            'key' => '豆笑笑,个人博客,网站模板,模板分享,互联技术,技术教程,网站搭建',
            'desc' => '豆笑笑个人博客，是记录博主学习和成长的一个自媒体个人博客。关注于web技术和后台技术的学习研究,同时免费提供了个人博客模板（带源码）下载学习以及网站建设！',
        ],

        'internet' => [
            'title' => '互联网-最新互联网技术资讯_豆笑笑个人博客',
            'key' => '互联网,豆笑笑,个人博客',
            'desc' => '豆笑笑个人博客，是记录博主学习和成长的一个自媒体个人博客。关注于web技术和后台技术的学习研究,同时免费提供了个人博客模板（带源码）下载学习以及网站建设！',
        ],

        'technology' => [
            'title' => '技术技巧-记录分享最新技术_豆笑笑个人博客',
            'key' => '技术技巧,豆笑笑,个人博客',
            'desc' => '豆笑笑个人博客，是记录博主学习和成长的一个自媒体个人博客。关注于web技术和后台技术的学习研究,同时免费提供了个人博客模板（带源码）下载学习以及网站建设！',
        ],

        'search' => [
            'title' => '搜索-站内搜索助手_豆笑笑个人博客',
            'key' => '豆笑笑,站内搜索,搜索,搜索助手',
            'desc' => '豆笑笑个人博客，是记录博主学习和成长的一个自媒体个人博客。关注于web技术和后台技术的学习研究,同时免费提供了个人博客模板（带源码）下载学习以及网站建设！',
        ],
    ],

];
